SGLang_Data_20260615_dp2_sweep/hisim/hisim_dp2_rr1_il2048_ol128.log
benchmark_args=Namespace(bench_mode='simulation', backend='sglang', base_url=None, host='127.0.0.1', port=32151, dataset_name='random', dataset_path='', model='/mnt/nfs02/users/tjiang/Gitrepo/models/Qwen3-8B', served_model_name=None, tokenizer=None, num_prompts=200, sharegpt_output_len=None, sharegpt_context_len=None, random_input_len=2048, random_output_len=128, random_range_ratio=0.0, image_count=1, image_resolution='1080p', image_format='jpeg', image_content='random', request_rate=1.0, use_trace_timestamps=False, max_concurrency=None, output_file='/mnt/nfs02/users/tjiang/Gitrepo/sglang/SGLang_Data_20260615_dp2_sweep/hisim/hisim_dp2_rr1_il2048_ol128.jsonl', output_details=False, print_requests=False, disable_tqdm=True, disable_stream=True, return_logprob=False, seed=1, disable_ignore_eos=False, extra_request_body=None, apply_chat_template=False, profile=False, plot_throughput=False, profile_activities=['CPU', 'GPU'], profile_num_steps=None, profile_by_stage=False, profile_stages=None, lora_name=None, lora_request_distribution='uniform', lora_zipf_alpha=1.5, prompt_suffix='', pd_separated=False, profile_prefill_url=None, profile_decode_url=None, flush_cache=True, warmup_requests=1, tokenize_prompt=False, gsp_num_groups=64, gsp_prompts_per_group=16, gsp_system_prompt_len=2048, gsp_question_len=128, gsp_output_len=256, gsp_range_ratio=1.0, mooncake_slowdown_factor=1.0, mooncake_num_rounds=1, mooncake_workload='conversation', tag=None)
Namespace(bench_mode='simulation', backend='sglang', base_url=None, host='127.0.0.1', port=32151, dataset_name='random', dataset_path='', model='/mnt/nfs02/users/tjiang/Gitrepo/models/Qwen3-8B', served_model_name=None, tokenizer=None, num_prompts=200, sharegpt_output_len=None, sharegpt_context_len=None, random_input_len=2048, random_output_len=128, random_range_ratio=0.0, image_count=1, image_resolution='1080p', image_format='jpeg', image_content='random', request_rate=1.0, use_trace_timestamps=False, max_concurrency=None, output_file='/mnt/nfs02/users/tjiang/Gitrepo/sglang/SGLang_Data_20260615_dp2_sweep/hisim/hisim_dp2_rr1_il2048_ol128.jsonl', output_details=False, print_requests=False, disable_tqdm=True, disable_stream=True, return_logprob=False, seed=1, disable_ignore_eos=False, extra_request_body=None, apply_chat_template=False, profile=False, plot_throughput=False, profile_activities=['CPU', 'GPU'], profile_num_steps=None, profile_by_stage=False, profile_stages=None, lora_name=None, lora_request_distribution='uniform', lora_zipf_alpha=1.5, prompt_suffix='', pd_separated=False, profile_prefill_url=None, profile_decode_url=None, flush_cache=True, warmup_requests=1, tokenize_prompt=False, gsp_num_groups=64, gsp_prompts_per_group=16, gsp_system_prompt_len=2048, gsp_question_len=128, gsp_output_len=256, gsp_range_ratio=1.0, mooncake_slowdown_factor=1.0, mooncake_num_rounds=1, mooncake_workload='conversation', tag=None)

#Input tokens: 217693
#Output tokens: 12597
Starting warmup with 1 sequences...
Warmup completed with 1 sequences. Starting main benchmark run...
async_request_profile api_url='http://127.0.0.1:32151/start_profile' body={'activities': ['CPU', 'GPU'], 'num_steps': None, 'profile_by_stage': False, 'profile_stages': None}
Simulation triggered
async_request_profile api_url='http://127.0.0.1:32151/start_profile' body={'activities': ['CPU', 'GPU'], 'num_steps': None, 'profile_by_stage': False, 'profile_stages': None}
Simulation stop triggered

============ Serving Benchmark Result ============
Benchmark Mode:                          simulation
Backend:                                 sglang    
Traffic request rate:                    1.0       
Max request concurrency:                 not set   
Successful requests:                     200       
Benchmark duration (s):                  213.13    
Elapsed time (s):                        18.22     
Total input tokens:                      217828    
Total input text tokens:                 -1        
Total input vision tokens:               -1        
Total generated tokens:                  12597     
Total generated tokens (retokenized):    -1        
Request throughput (req/s):              0.94      
Input token throughput (tok/s):          1022.05   
Output token throughput (tok/s):         59.11     
Peak output token throughput (tok/s):    -1.00     
Peak concurrent requests:                -1        
Total token throughput (tok/s):          1081.16   
Concurrency:                             -1.00     
----------------End-to-End Latency----------------
Mean E2E Latency (ms):                   457.14    
Median E2E Latency (ms):                 457.40    
---------------Time to First Token----------------
Mean TTFT (ms):                          27.00     
Median TTFT (ms):                        26.06     
P99 TTFT (ms):                           49.59     
-----Time per Output Token (excl. 1st token)------
Mean TPOT (ms):                          6.97      
Median TPOT (ms):                        6.82      
P99 TPOT (ms):                           7.75      
---------------Inter-Token Latency----------------
Mean ITL (ms):                           6.94      
Median ITL (ms):                         6.81      
P95 ITL (ms):                            6.90      
P99 ITL (ms):                            7.04      
Max ITL (ms):                            53.14     
==================================================